#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.password: Refreshing state... [id=a]Q%6P!A1ws91BeqoO[pRpUY6-H%QCtC]
azuread_application.default: Refreshing state... [id=a265a4ff-4043-4828-b70f-4cb02aa098ce]
azuread_service_principal.default: Refreshing state... [id=05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1]
azuread_service_principal_password.default: Refreshing state... [id=05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1/password/3a965c14-cf28-497e-ab9d-63ace923e134]
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev]
azurerm_role_assignment.aks_network: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.Authorization/roleAssignments/adf99c52-7f5c-9486-2eec-fdfe045de442]
azurerm_container_registry.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev]
azurerm_role_assignment.aks_acr: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev/providers/Microsoft.Authorization/roleAssignments/a5c0679b-12b1-4a43-c312-5c6434900cfb]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerService/managedClusters/liatrio-aks-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_container_registry.default has been deleted
  - resource "azurerm_container_registry" "default" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
              - identity_client_id = ""
              - key_vault_key_id   = ""
            },
        ] -> null
      - georeplication_locations      = [] -> null
      - georeplications               = [] -> null
      - id                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev" -> null
      - location                      = "eastus2" -> null
      - login_server                  = "liatrioacrdev.azurecr.io" -> null
      - name                          = "liatrioacrdev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "liatrio-rg-dev" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Standard" -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
    }

  # azurerm_kubernetes_cluster.default has been deleted
  - resource "azurerm_kubernetes_cluster" "default" {
      - automatic_channel_upgrade           = "" -> null
      - disk_encryption_set_id              = "" -> null
      - dns_prefix                          = "tfq-liatrio-aks-dev" -> null
      - dns_prefix_private_cluster          = "" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "tfq-liatrio-aks-dev-63a4c271.hcp.eastus2.azmk8s.io" -> null
      - id                                  = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerService/managedClusters/liatrio-aks-dev" -> null
      - kube_admin_config                   = [] -> null
      - kube_admin_config_raw               = (sensitive value)
      - kube_config                         = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZIVENDQXdXZ0F3SUJBZ0lRWmdwekhTRkRxell4TlNiL3RTeE1OekFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWVGdzB5TWpBeU1UY3dNRFF6TlRoYUZ3MHlOREF5TVRjd01EVXpOVGhhTURBeApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1SVXdFd1lEVlFRREV3eHRZWE4wWlhKamJHbGxiblF3CmdnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUM5OWFFK0hQUmFDTityNHJrZjgvUjcKeXFIWFBrU05Qc1pOOTl6ZkFBa1pZZTI1d0VVWFUwL0NueWR0aENCZG9wUm44WG5BTG1RTENEQllJbGxHQitZVApCWnoycU43QWRzcTFkdDV1R3R3N054OHdnK1FhblNXNDBlRW9qZHlCa1JNVEdkRFpFR1hHN2x3ZjFIaU9WMEt2CndobFExTDkyZXQ4Z3Zma2Q3RE0rbjBzdENMRHR3bVpQajc3bzJaTkZ0bFpzQ2dYTWlkeWwxLzVFbVl1b2RlUEMKNXBJTmNFQkhVM1BvMkJWdWdReWpoV0FwQkp3Wm9adk9JNWlBZ3lyMjV1TC9iKzBHWEwraWRwSjJVMXZDbTZuVwpZTE9DOGxaYmFib09YNnVNTnRDTmlnVGMvYXRyaG5sd0t3UG5BOFUrdVdjNVlHVHRlM3ZBSExhcjM2WXZPa3I4Cm5keXpWekVoc2c0UlBtS2JFMEI2cmhYY0Y1UG1iR3YxWGMzRUZtZE1mK1IzTmpOTlNESjE0NGpOMy9yMTZiSkYKQko1dkZpTDNKZUV3dVNDT3RteEJHcmMxZ0F4NmhmRXp4VkNSRStLUVhJT1EzTVpQcVBoT2wvK0s4UmhjckFjMwpQdTBUdkU5VWhkalV0WlJ0aGlya3lsRzlNNGlUWmtWOE5ZMDIxb1oxVzc4elhhVUVkaWFrQml6cE9jTm5KdWp1CnM3N1Vhbk9jcmptYzhDRXptdSs1ODdRdjlHRmhYeFRzeHJiblM1UnE1TGpOcFJQakJRUHQ0T2V4eDJmUUc3ZWwKc3Q0ZmZrcmIrSncrbnV3MDZ4RllqMStlNWhGRDNQa1J3bWVOWEVQdDlqRUh5aWVzZ3REdTRhejk2eHBYNU1CcApHRG5SSnRlVytvTitIV1BiS3RWM2Z3SURBUUFCbzFZd1ZEQU9CZ05WSFE4QkFmOEVCQU1DQmFBd0V3WURWUjBsCkJBd3dDZ1lJS3dZQkJRVUhBd0l3REFZRFZSMFRBUUgvQkFJd0FEQWZCZ05WSFNNRUdEQVdnQlJXQnF6d3FDRlEKYU9vQy9HZVVxMW9WVmFoMVdEQU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUF1eFRWempYQWJkYTFoUG1QR3BYWApWc3lQZllzbkpkTE12Qm1XdzJjTFM1OEVZbnlpQWFEM2dvaTkra0FFQ2RPeGdTRG5WYXV3MFYrTG9iNVlhWWJUClI0QTZIWGZrTFB5ZVYyL3RiU2VJdE56MGZjaE1tYmNOYk9ENVRneWtpamJzWDNGN3kzSzlBdmc1RW5NdTVSQ2wKQWEwa0szWmtpc3hyMUdScFI1T2lqNnBHek1VVUI3aXV2MmxRVElIZTJEdmF0K0xWSHN1VGJKWk1CMFFhaXV0UQpQZ21LWkZDNjYySzF2TTVyT3RwelJObFFwRk9TVk9LNnJ2a2ZEdEQ2Z1JDTHAyc1QwcktuTDJneVZpak5DSnlqCmNIcU1tZ3MzakxQekJKc21BMk12SXNiVUNhRWhyMVNwT3JkOFpWZG5SUEMwbUVRTkJTYXQ1ZC9RNExsVkI1Rk4KL2F6NzFDOTVjMnJPWnV4SHphUlh0T2RmMGx3TzNoelYrbjZTVWordHVJRFpRemtvUWxqbVl1NGx3UGVvdjBxZApVMGJWSW1EMzBNQXZDSWNFdGJZaEYrMFpYUlBmY2JSclVERG1pTXMvcElvdlByZXQrSFBuaStmYzJxQ2VSeDNVCnFZYm1vTGdmM0VMUExScmtJYlFyRmVFVkRiZVVia2FoZ1owaFhWeE9mSDU5NWxrOCtXV0thTzkxWkVnV0xQK0gKWDdQRnZmNGRJcVRJUmh6eFc1d1lCTVM2ZzNyQVhNc0I0MGFqUVEzRlhJZEkzT0lHMzVSZEFURjhkamg5YTJKcwo3R3RYYnBUNjF1YWZyb2VQaHVaR0dOSitIazQwWVRvNlFpZ2pMQkRDMVdFMjREVzZhKzkydVoxdHVXRGtKdVVYCmFNN0JHUCs4dEQ2cUJOd2xtUFZxdmE0PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBdmZXaFBoejBXZ2pmcStLNUgvUDBlOHFoMXo1RWpUN0dUZmZjM3dBSkdXSHR1Y0JGCkYxTlB3cDhuYllRZ1hhS1VaL0Y1d0M1a0N3Z3dXQ0paUmdmbUV3V2M5cWpld0hiS3RYYmViaHJjT3pjZk1JUGsKR3AwbHVOSGhLSTNjZ1pFVEV4blEyUkJseHU1Y0g5UjRqbGRDcjhJWlVOUy9kbnJmSUwzNUhld3pQcDlMTFFpdwo3Y0ptVDQrKzZObVRSYlpXYkFvRnpJbmNwZGYrUkptTHFIWGp3dWFTRFhCQVIxTno2TmdWYm9FTW80VmdLUVNjCkdhR2J6aU9ZZ0lNcTl1YmkvMi90Qmx5L29uYVNkbE5id3B1cDFtQ3pndkpXVzJtNkRsK3JqRGJRallvRTNQMnIKYTRaNWNDc0Q1d1BGUHJsbk9XQms3WHQ3d0J5MnE5K21MenBLL0ozY3MxY3hJYklPRVQ1aW14TkFlcTRWM0JlVAo1bXhyOVYzTnhCWm5USC9rZHpZelRVZ3lkZU9JemQvNjllbXlSUVNlYnhZaTl5WGhNTGtnanJac1FScTNOWUFNCmVvWHhNOFZRa1JQaWtGeURrTnpHVDZqNFRwZi9pdkVZWEt3SE56N3RFN3hQVklYWTFMV1ViWVlxNU1wUnZUT0kKazJaRmZEV05OdGFHZFZ1L00xMmxCSFltcEFZczZUbkRaeWJvN3JPKzFHcHpuSzQ1blBBaE01cnZ1Zk8wTC9SaApZVjhVN01hMjUwdVVhdVM0emFVVDR3VUQ3ZURuc2NkbjBCdTNwYkxlSDM1SzIvaWNQcDdzTk9zUldJOWZudVlSClE5ejVFY0pualZ4RDdmWXhCOG9ucklMUTd1R3MvZXNhVitUQWFSZzUwU2JYbHZxRGZoMWoyeXJWZDM4Q0F3RUEKQVFLQ0FnRUF2YlJWRC92SWh6Vy9jaC9jOHkwbFpvOHBheFN6VHo5MnVSeWtoa3U1eXBDQzRYTkRUSlVWM1c0bAo2UGYvZnFORGhENmljU3VqRzJWVktsODdPblhlN2ZZNEdCanpROUFlaG5Tc2s5YmRRNEc3OHk1MEdhUUFyUDlrCjFhUStwMkpqWXpydjJDYkpEWTZ6ajlJWGgwZGJ3THlkblp5cGpNQU9udHM1c3dsVTcrQVRLbWs0a0drSTFjSGYKVFJra080VnA3MEZmSXpJMm1hVUlPQ2dEVWZ4UnRpMmZoQzRxODFCRFBEQzN6b0N3UjRtR1M5QmZ1RFV0clFMZApaTklaa1ROcFZPSEpHd1o3RnR0RlQwZldKcFpnV1VoL1hYRjRqcGdhaUFwQS9xa3JRMzZuZHE4YWh5cG5rbjVTCnlsMTRtVGg4L3M3bVhFaHFnS1BzUmQ3M1RzanZZbmhuc0w5UVdMa1d3bkR5NkxpUVdMZGkwRWVzeGk4TVpnVWkKandtWC9MY1RSYmxWRmlQSWNtbGFNMi9DbWNvUzJtdFBXN2xYK1NuMjlUOHVUZVN3WEI4eWdmY3J4Q3E1TVFrRQp2ZjB0QnFjbnFlQWtMNVY1QTNpMjllVjc4TEMyNnMzOVJReFFPa2xpZmxCTnJjWmo5OW1GVkc1NDE5WHZTbHZECi9paEo3SXo5MytJaTlBaTY2UGFFWnV2YWlXbG9XQll0Y0htZHMzbkJnbHJYbko5WG5lNlJlOGt0alcrNHVMY3cKSWRqdDIwa1BsWktkczhjL291Z0orSUF2NmowL0NsZXI3MHd3Y2FKeTR4Q0NqeE9jK0YxYTdyQkExbjVKWWpzbAp5UXlLMlRpTDZzUzIzZXoyRHNTd1Y0bzRUMFh4d1F1Y3BacmFzQWxERFNYQ0NxS1dMTmtDZ2dFQkFQRXE2SFFMClUzbFhhY29wMzJaQTdBcW54SHZYcUVWdlM3VllvM3l3WWVnMC9qU3NyN1NkWmpEK2QzazNnbnY5Uk5jTmxpOTEKK0hxVGxzaVg3UHhMcWY1SlEzR0t1Nmk0RXc5T2FwSlNxck4zUTZrZWgrenV4bVliZkNFK0pMbm9oUWV4UkVWSgpqRjFVckp3QUhvaWExcnRFMlM3T0hyc3M0emtUTElyRmc0eGlsOXhBSG5oa042bkYvNlBIeVdTTVNicDlGeXF4ClUwdndJdTdQQzVka1ZOWnNnaHBOMGFSeXJhdURvZ3NicGZZckFxNi9lQkpDdlhsQ1JQeTdhdWUzNEpEbTRDNE0KWkI0S25GSk5WYlRqZ0ZmZlFTanBFNVhjc3JTNGlJV2gweWp1VFJpTXNPdFFXamZROGdrd0lIWUUvZE1yMFVSZAovK0hmT08vSm9XajYzWjBDZ2dFQkFNbWtlRFVMaTBLRmdUaUZGL1RpNjZCTWY0YVAva0Z6RXRTcWtwZE5FbEFmCktpb2dtbStsUXdJdHlpa2tlTm5nSGxhbkNHZ2VTYW5aL0cvZVdza0dabVpSYlRPdHBYSVlYTkU1bjFtMlZ1VloKZW1ZMTVrN0V6T1NDVS96cXNsOFNIV3ZDbGpyOUdwdnNtT1VkZklmNFdVTWVhQVRKTTE4Z3AyNVVZWk1pSHY3TgpUZTRFK2pqem1HRHZGbXozTi8vVng2V0V3VjhhdzF4SWM0dkdQZ0FQK09WUlByK29QcVROcTIwYVFiYzFhdFFECjUzZlJKZkZhVEVoeDhjR3o3bFp4TWhkSVZ1Y2pBYktGZ0tuSzZaZUk0aTJQc09jNzlrQkVLdzk3blN3VFBueisKVUNEQ0gwRExJVVRsbitpb3FLajFMZWpWOTZBcXcyckJGby96ZGJDWDdNc0NnZ0VCQUlpMjZrL2VtOU9OMmtyZwpzZVFscWFuZ3NXSURQMEVkZHEyM01mYmRocU04WjE4MUJlWTkxRkN4OE1pbXp6RzZ3ZXVucUJ2L3BIelliZ0lKCkhpOW9OVllSOGtuTGU5YUpnMFNLRDZBamZPR0FHcnNrczZsOU1ydHZtVTYvQzlMWUhaSGV5L1Q3WExjTDZVNEcKUTBqdGZnMXJXak5PWmQxMTlObkdKTm9HWGl5WE43K0VHY0htRGlnUU5udUNKb2o1ZmxKWjEyZzhYaHdPWmI4NwpZRGJTaWNXRWZieXJvTXk0dGZzbEJCZUg5TzA0TkswYm5kVzhQKzBkeEQ0QmdQa2JKQk1BenRWTDhQV1d6a2RaCno5eGJtOFkwcVp1bmhaTFBLZitKSE51a2dUQVM1MkdqWUNnRnhSOGZOQlpCVWlXVmJzN25hQnA1cnpVOGRlcDUKUXlkZ0Q0RUNnZ0VBUjVsK0VaL2F3REUxdEVNV1FaOTkrWHFRWWRDcGdNWUNycjh1dEVqcXNzYU9LMDFPYVV4dQpZY3l1bHpOYk1rb3htNlZPQitLUlY1Mk8xSTVKQUU2a2Q3cDhJemlLb2R2aXdXeExtQWgyREpSY01RVDhsWVd1CkY0bnJsc2dqdER4emMvc3hheHJLb3drOU5VWG1IVVhqTkVFTXdINU5Ibjh5MUt0anhtSDhUWS9MRnpSdlFWL0cKQU0yRTBnWnF2UTVGQ1JIOXMrNkY1alBYeTQ4R0h2R00rS2lEdG54Z1doYXB3MkRxYXNxdDkwQzNwVVQveXhhOApOWkU0UGdiTkg2YXNHYlpYSFZYQjJZa3NLWjVpbWF0Q1hObEVBS2U3QmhEdWxWM1libmthM0RsVmJIeGhxcGsyClpBZUJZNVRYNXI3QW9ZZXdtUS8yT2ViOFF2czVGQTZ1UndLQ0FRQWIxZmNMb0g1L2FSNkhqcURXN2hrTGZSWkQKSmJmTW9yNFhTcVJyWGR3clNBT1BwczRwQ016LzVRczVtWnhqRWhYVXc0UkRwNGNQS0tqSGJEU3dQY1I3QjRzZApKR3VRVCtUcXhnZ0RRU3JQWEtFbXFTZUJvdExydUN3ZXpZcUQrMFc0dnF4NWRrQmNBbm1ESEJ6ZzJBK1luMDkyCnNRcGdaTk5KMzZqMmIzVFNKcDhoN2E0bERwVlZRaXpXSWZzZDR1WkZIU05nYktkdER4djhDellJMUJlOTFJL24KbVZuL1hMVmJJQTVzTHEyNmhlRDFjNVY1TVUxa2FLdnN5YktETml3a3BIQUw5bk1GZkQwak9uMHF4ZUQvK0VmVwpwTWpBaVJkU1dwYllRK2VEVzMxS3hvUjNiODZWNWpNSUNIeDJQVXdsZjUyci8xa0RKbWF1SVVCYkR5dHgKLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUU2VENDQXRHZ0F3SUJBZ0lSQUpWbE5pUmlZRDBEbVFKa3pFSEF2OFl3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpJd01qRTNNREEwTXpVNFdoZ1BNakExTWpBeU1UY3dNRFV6TlRoYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCnpUNWpIYVpqVGdJZ2ZRMFZEQWtTZ2hjUzkycEU1M3hNL1ZPSWJtQmc5U0ZrTm4razNOQllnVEpZWXZ0NHdDZHYKVkUvZWlTNG9ZSzZQd3F2dkFycmdVRk5FLzRUaGhhZ3Fma05iT3Z0VUM3M0NubkZHWHF2UktmSG9zVUhsUG5YTApkRFltQVNsb0piRmxnQTdLNWhCSCtyWEtqR1VSMjZKUkxXV2xMRnVGV0t5S3NaTHZZYnRoNmx2UndNSVdGdHBqCi9YSWpwS1dVS2d6T3pyaEw0RkI2ODlkV1YvbFhyTDlOOW51UjB3L0R4MGxHSitTd3kwaVFsUHkxNzVWWVBpNXMKR3NwcVpVdVJiejQzZGNKMW1rYTA5MkpQT0pXdGpWZ2V4WGNEakJvcVR3bUhHZnp6Qkp6TWlGSjQ4ckM1dGZQQwp2cWh4MnZRVUd1V3dNNFFvWGw4Y1lTUVlVbnNKck1zQXJiaFhnVWJJb0E1V3RUcDFmUUtEdVVyOHR6NlBSRERoCndidE4wS2V2NUlVM295dWF6NHVZWTFZWUplWm9ZcFR5akNFWmdJeXlwbDNjNHFJTDAraUJ5NmlDa2RCdXJQRVoKUVVhMzFEMHJZYUhLL0Jsd0s5Y1RWUGRoMEZjbnBQTit0RENUcDdhSEZPWkFiM1RXTFhXZFpONWhLV0ttak14MAo2RjJRbU1oODk2OUQ5a0Vtb2F1VUJkV25hMVF5bmxCeGZnVjBsV000QUN6Nkh5QnZRdUV1dnFkWjZjZ3dMYUFTCit6SXFNaktwWG84UUxLTEFLRSt4bGlJM01tZWU3N3JibDl1bEFEZHlydmh4QTN1ZTgrVlE1ekdBcXVHUHBveGkKTkViaEc2QTJJQjYvbGVXQ2NKdW5oUFpjekpYRXNyRGtDZndkM0tvUnNWOENBd0VBQWFOQ01FQXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGRllHclBDb0lWQm82Z0w4Clo1U3JXaFZWcUhWWU1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQ0FRQ0lrOER1U3VyWU0wYWtuNXM1TExJcXpWV04KREkrZ1NEV3Q0Z0xoanA0UlI4U2FnVDdrekZjZU0xRHZJa1lpR1huamNzNW4xV1VySGJMUjJUd05zd244MzE1SwpVM3pTUDVKMytDUDJHeTM5OXVpbERGNXl6QU5UT3J1bTFBbi96MEg2STFqVTg1NWR3OFZQY3BEell2RW56bE81CkVqYWJXSXVpUVpyRmY0OVdaUW9RNnZ1K0YzOElrM3NJQ2JncmFtVVRwZ2JQaFUvR3lVWkcwdXdwQWFCaXZhSjYKck1BT2xYVE83VjI4R09Xelh5M0Z0bUdWcm1la1VHcTQvZ0c2YU54d0JHSEZ2d1pRY01WdDQ1ZEE1QzM4eW81Kwp2ZFByTG1KaEIyMzBCUW83aHVvZkRIQ2tPVm8xcS95VFZldk1IRUtucFRaRm9zZmlLZVhVMFV1SjZjcGhLbXlGCi83SjU5TENBL1V5ekZPUUgyZEUxWjNWSDNDa3UwVlFlUVovd0VaQW9wZUp5aU80TzdDM1QwcUI0MFZPNnZzVFUKUjNxeVAvcUpSWEtLQWtpS0x4REt5SzZVUWd0d1ZKbE52ektPNnhCMUc1UjE5allFSm9ab25WR1ltRldRaXJWOApqNytPWHNjS25LdkNKWXFyV08wbWdvVjlFYmtoR3gwaFA0YnJIZHdMM1RqangrcXpXZzFVTVAxaHJUZElsTjhvCnJ4SU9jUi9JRmRJVVpIdWtBM0Qxei9ueFhpdzZreWpWUHBiUnp6Q0xqdmZocUw3eWk4VnBIbHo5RzgxWTNmM08KRHdXWHJIeDUvZ3N5bzFRVmpURWdPUDdML0NKZW1DRkFQN3JTYXBOU1NnU2xkbk94d0lYZU44bjFxTjBjdEt4bAplUzFKbG0wbnZqM3UvbUJta0E9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://tfq-liatrio-aks-dev-63a4c271.hcp.eastus2.azmk8s.io:443"
              - password               = "3d5306490afa53b2ec3146fa109b957853550ac0e46c424043113d8b18f5209fb4591404a5d85ec03c968a0a3a4ebfeb54ddb0d205695fbe12e71893c98867f8"
              - username               = "clusterUser_liatrio-rg-dev_liatrio-aks-dev"
            },
        ] -> null
      - kube_config_raw                     = (sensitive value)
      - kubernetes_version                  = "1.21.9" -> null
      - local_account_disabled              = false -> null
      - location                            = "eastus2" -> null
      - name                                = "liatrio-aks-dev" -> null
      - node_resource_group                 = "MC_liatrio-rg-dev_liatrio-aks-dev_eastus2" -> null
      - portal_fqdn                         = "tfq-liatrio-aks-dev-63a4c271.portal.hcp.eastus2.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - private_dns_zone_id                 = "" -> null
      - private_fqdn                        = "" -> null
      - private_link_enabled                = false -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "liatrio-rg-dev" -> null
      - sku_tier                            = "Free" -> null

      - addon_profile {
          - aci_connector_linux {
              - enabled = false -> null
            }

          - azure_keyvault_secrets_provider {
              - enabled                 = false -> null
              - secret_identity         = [] -> null
              - secret_rotation_enabled = false -> null
            }

          - azure_policy {
              - enabled = false -> null
            }

          - http_application_routing {
              - enabled = false -> null
            }

          - ingress_application_gateway {
              - enabled                              = false -> null
              - ingress_application_gateway_identity = [] -> null
            }

          - kube_dashboard {
              - enabled = false -> null
            }

          - oms_agent {
              - enabled            = false -> null
              - oms_agent_identity = [] -> null
            }

          - open_service_mesh {
              - enabled = false -> null
            }
        }

      - default_node_pool {
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          - kubelet_disk_type            = "OS" -> null
          - max_count                    = 0 -> null
          - max_pods                     = 110 -> null
          - min_count                    = 0 -> null
          - name                         = "default" -> null
          - node_count                   = 1 -> null
          - node_labels                  = {} -> null
          - only_critical_addons_enabled = false -> null
          - orchestrator_version         = "1.21.9" -> null
          - os_disk_size_gb              = 128 -> null
          - os_disk_type                 = "Managed" -> null
          - os_sku                       = "Ubuntu" -> null
          - type                         = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled            = false -> null
          - vm_size                      = "Standard_D2_v2" -> null
        }

      - network_profile {
          - dns_service_ip     = "10.0.0.10" -> null
          - docker_bridge_cidr = "172.17.0.1/16" -> null
          - load_balancer_sku  = "Standard" -> null
          - network_plugin     = "kubenet" -> null
          - outbound_type      = "loadBalancer" -> null
          - pod_cidr           = "10.244.0.0/16" -> null
          - service_cidr       = "10.0.0.0/16" -> null

          - load_balancer_profile {
              - effective_outbound_ips    = [
                  - "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/MC_liatrio-rg-dev_liatrio-aks-dev_eastus2/providers/Microsoft.Network/publicIPAddresses/1f4c813b-9adf-435e-b070-70449b42da67",
                ] -> null
              - idle_timeout_in_minutes   = 0 -> null
              - managed_outbound_ip_count = 1 -> null
              - outbound_ip_address_ids   = [] -> null
              - outbound_ip_prefix_ids    = [] -> null
              - outbound_ports_allocated  = 0 -> null
            }
        }

      - role_based_access_control {
          - enabled = true -> null
        }

      - service_principal {
          - client_id     = "9610f47c-08fb-4b94-ae1d-8ad2f8fb57e1" -> null
          - client_secret = (sensitive value)
        }
    }

  # azurerm_resource_group.default has been deleted
  - resource "azurerm_resource_group" "default" {
      - id       = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev" -> null
      - location = "eastus2" -> null
      - name     = "liatrio-rg-dev" -> null
    }

  # azurerm_role_assignment.aks_acr has been deleted
  - resource "azurerm_role_assignment" "aks_acr" {
      - id                   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev/providers/Microsoft.Authorization/roleAssignments/a5c0679b-12b1-4a43-c312-5c6434900cfb" -> null
      - name                 = "a5c0679b-12b1-4a43-c312-5c6434900cfb" -> null
      - principal_id         = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev" -> null
    }

  # azurerm_role_assignment.aks_network has been deleted
  - resource "azurerm_role_assignment" "aks_network" {
      - id                   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.Authorization/roleAssignments/adf99c52-7f5c-9486-2eec-fdfe045de442" -> null
      - name                 = "adf99c52-7f5c-9486-2eec-fdfe045de442" -> null
      - principal_id         = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> null
      - role_definition_name = "Network Contributor" -> null
      - scope                = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.default will be created
  + resource "azurerm_container_registry" "default" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus2"
      + login_server                  = (known after apply)
      + name                          = "liatrioacrdev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "liatrio-rg-dev"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + storage_account_id            = (known after apply)
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_kubernetes_cluster.default will be created
  + resource "azurerm_kubernetes_cluster" "default" {
      + azure_policy_enabled                = (known after apply)
      + dns_prefix                          = "tfq-liatrio-aks-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus2"
      + name                                = "liatrio-aks-dev"
      + node_resource_group                 = (known after apply)
      + open_service_mesh_enabled           = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "liatrio-rg-dev"
      + sku_tier                            = "Free"

      + aci_connector_linux {
          + subnet_name = (known after apply)
        }

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_keyvault_secrets_provider {
              + enabled                  = (known after apply)
              + secret_identity          = (known after apply)
              + secret_rotation_enabled  = (known after apply)
              + secret_rotation_interval = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }

          + open_service_mesh {
              + enabled = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = (known after apply)
          + gateway_name                         = (known after apply)
          + ingress_application_gateway_identity = (known after apply)
          + subnet_cidr                          = (known after apply)
          + subnet_id                            = (known after apply)
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = (known after apply)
          + secret_rotation_interval = (known after apply)
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_mode       = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + outbound_type      = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + oms_agent {
          + log_analytics_workspace_id = (known after apply)
          + oms_agent_identity         = (known after apply)
        }

      + role_based_access_control {
          + enabled = true
        }

      + service_principal {
          + client_id     = "9610f47c-08fb-4b94-ae1d-8ad2f8fb57e1"
          + client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # azurerm_resource_group.default will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "liatrio-rg-dev"
    }

  # azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_network will be created
  + resource "azurerm_role_assignment" "aks_network" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @husseinsa, Action: `pull_request`*